In [2]:
import os
import re
import numpy as np
import pandas as pd
import geopandas as gpd
import matplotlib.cm as cm
import matplotlib.pyplot as plt

In [3]:
df1 = pd.read_csv("total-household-electricity-consumption-by-dwelling-type-2005-to-2020.csv")
df2 = pd.read_csv("surface-air-temperature-monthly-mean.csv")
df3 = pd.read_csv("rainfall-monthly-total.csv")
df4 = pd.read_csv("relative-humidity-monthly-mean.csv")

In [9]:
df1.shape

(187, 11)

In [8]:
df2.shape

(467, 2)

In [10]:
df3.shape

(467, 2)

In [5]:
df4.shape

(467, 2)

In [11]:
df1.columns.values

array(['month', 'overall', 'public_housing', '1-room_2-room', '3-room',
       '4-room', '5-room_and_executive', 'private_housing',
       'private_apts_and_condo', 'landed_properties', 'others'],
      dtype=object)

In [12]:
df2.columns.values

array(['month', 'mean_temp'], dtype=object)

In [13]:
df3.columns.values

array(['month', 'total_rainfall'], dtype=object)

In [17]:
df5 = pd.merge(df1, df2,left_on='month',right_on='month', how='right')

In [18]:
df5.sample(3)

,month,overall,public_housing,1-room_2-room,3-room,4-room,5-room_and_executive,private_housing,private_apts_and_condo,landed_properties,others,mean_temp
119,1991-12,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,25.6
237,2001-10,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,27.6
432,2018-01,558.7,328.3,10.6,58.5,136.4,122.8,229.6,150.4,79.3,0.7,26.1

In [26]:
df6 = pd.merge(df5, df3, left_on='month', right_on='month', how='right')

In [27]:
df6.sample(3)

,month,overall,public_housing,1-room_2-room,3-room,4-room,5-room_and_executive,private_housing,private_apts_and_condo,landed_properties,others,mean_temp,total_rainfall
109,1991-02,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,27.1,45.5
292,2006-05,522.0,318.9,6.0,59.1,126.6,127.2,202.1,121.0,81.1,1.1,28.1,205.7
171,1996-04,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,27.8,178.2

In [86]:
#adding relative humidity
df7=pd.merge(df6, df4, left_on='month', right_on='month', how='right')

In [70]:
df7.head(3)

,month,overall,public_housing,1-room_2-room,3-room,4-room,5-room_and_executive,private_housing,private_apts_and_condo,landed_properties,others,mean_temp,total_rainfall,mean_rh
0,1982-01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,25.9,107.1,81.2
1,1982-02,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,27.1,27.8,79.5
2,1982-03,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,27.2,160.8,82.3

In [71]:
df7.month

0      1982-01
1      1982-02
2      1982-03
3      1982-04
4      1982-05
        ...
462    2020-07
463    2020-08
464    2020-09
465    2020-10
466    2020-11
Name: month, Length: 467, dtype: object

In [87]:
df7['month']=pd.to_datetime(df7["month"], format = "%Y-%m")

In [73]:
df7['month']

0     1982-01-01
1     1982-02-01
2     1982-03-01
3     1982-04-01
4     1982-05-01
         ...
462   2020-07-01
463   2020-08-01
464   2020-09-01
465   2020-10-01
466   2020-11-01
Name: month, Length: 467, dtype: datetime64[ns]

In [88]:
df7['month-year']=pd.to_datetime(df7['month']).dt.to_period('M')

In [75]:
df7['month-year']

0      1982-01
1      1982-02
2      1982-03
3      1982-04
4      1982-05
        ...
462    2020-07
463    2020-08
464    2020-09
465    2020-10
466    2020-11
Name: month-year, Length: 467, dtype: period[M]

In [89]:
df7.isnull().sum()

month                       0
overall                   280
public_housing            280
1-room_2-room             280
3-room                    280
4-room                    280
5-room_and_executive      280
private_housing           280
private_apts_and_condo    280
landed_properties         280
others                    280
mean_temp                   0
total_rainfall              0
mean_rh                     0
month-year                  0
dtype: int64

In [90]:
df7=df7[df7['overall'].notnull()]

In [91]:
df7.isnull().sum()

month                     0
overall                   0
public_housing            0
1-room_2-room             0
3-room                    0
4-room                    0
5-room_and_executive      0
private_housing           0
private_apts_and_condo    0
landed_properties         0
others                    0
mean_temp                 0
total_rainfall            0
mean_rh                   0
month-year                0
dtype: int64

In [79]:
df7.shape

(187, 15)

In [92]:
df7.columns

Index(['month', 'overall', 'public_housing', '1-room_2-room', '3-room',
       '4-room', '5-room_and_executive', 'private_housing',
       'private_apts_and_condo', 'landed_properties', 'others', 'mean_temp',
       'total_rainfall', 'mean_rh', 'month-year'],
      dtype='object')

In [93]:
col=['month', 'month-year','overall', 'public_housing', '1-room_2-room', '3-room',
       '4-room', '5-room_and_executive', 'private_housing',
       'private_apts_and_condo', 'landed_properties', 'others', 'mean_temp',
       'total_rainfall','mean_rh']
df7=df7[col]

In [82]:
df7.sample(1)

,month,month-year,overall,public_housing,1-room_2-room,3-room,4-room,5-room_and_executive,private_housing,private_apts_and_condo,landed_properties,others,mean_temp,total_rainfall,mean_rh
442,2018-11-01,2018-11,608.6,356.6,11.5,62.3,148.6,134.2,251.2,167.0,84.3,0.8,27.3,169.6,83.2

In [94]:
df7.columns.values

array(['month', 'month-year', 'overall', 'public_housing',
       '1-room_2-room', '3-room', '4-room', '5-room_and_executive',
       'private_housing', 'private_apts_and_condo', 'landed_properties',
       'others', 'mean_temp', 'total_rainfall', 'mean_rh'], dtype=object)

In [95]:
df7.to_csv('dataset_new.csv', index=False)